__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 473, 473, 3)  0                                            
__________________________________________________________________________________________________
conv1_1_3x3_s2 (Conv2D)         (None, 237, 237, 64) 1728        input_1[0][0]                    
__________________________________________________________________________________________________
conv1_1_3x3_s2_bn (BatchNormali (None, 237, 237, 64) 256         conv1_1_3x3_s2[0][0]             
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 237, 237, 64) 0           conv1_1_3x3_s2_bn[0][0]          
__________________________________________________________________________________________________
conv1_2_3x3 (Conv2D)            (None, 237, 237, 64) 36864       activation_1[0][0]               
__________________________________________________________________________________________________
conv1_2_3x3_bn (BatchNormalizat (None, 237, 237, 64) 256         conv1_2_3x3[0][0]                
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 237, 237, 64) 0           conv1_2_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv1_3_3x3 (Conv2D)            (None, 237, 237, 128 73728       activation_2[0][0]               
__________________________________________________________________________________________________
conv1_3_3x3_bn (BatchNormalizat (None, 237, 237, 128 512         conv1_3_3x3[0][0]                
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 237, 237, 128 0           conv1_3_3x3_bn[0][0]             
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 119, 119, 128 0           activation_3[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 119, 119, 128 0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2_1_1x1_reduce (Conv2D)     (None, 119, 119, 64) 8192        activation_4[0][0]               
__________________________________________________________________________________________________
conv2_1_1x1_reduce_bn (BatchNor (None, 119, 119, 64) 256         conv2_1_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 119, 119, 64) 0           conv2_1_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 121, 121, 64) 0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2_1_3x3 (Conv2D)            (None, 119, 119, 64) 36864       zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
conv2_1_3x3_bn (BatchNormalizat (None, 119, 119, 64) 256         conv2_1_3x3[0][0]                
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 119, 119, 64) 0           conv2_1_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv2_1_1x1_increase (Conv2D)   (None, 119, 119, 256 16384       activation_6[0][0]               
__________________________________________________________________________________________________
conv2_1_1x1_proj (Conv2D)       (None, 119, 119, 256 32768       activation_4[0][0]               
__________________________________________________________________________________________________
conv2_1_1x1_increase_bn (BatchN (None, 119, 119, 256 1024        conv2_1_1x1_increase[0][0]       
__________________________________________________________________________________________________
conv2_1_1x1_proj_bn (BatchNorma (None, 119, 119, 256 1024        conv2_1_1x1_proj[0][0]           
__________________________________________________________________________________________________
add_1 (Add)                     (None, 119, 119, 256 0           conv2_1_1x1_increase_bn[0][0]    
                                                                 conv2_1_1x1_proj_bn[0][0]        
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 119, 119, 256 0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2_2_1x1_reduce (Conv2D)     (None, 119, 119, 64) 16384       activation_7[0][0]               
__________________________________________________________________________________________________
conv2_2_1x1_reduce_bn (BatchNor (None, 119, 119, 64) 256         conv2_2_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 119, 119, 64) 0           conv2_2_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 121, 121, 64) 0           activation_8[0][0]               
__________________________________________________________________________________________________
conv2_2_3x3 (Conv2D)            (None, 119, 119, 64) 36864       zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
conv2_2_3x3_bn (BatchNormalizat (None, 119, 119, 64) 256         conv2_2_3x3[0][0]                
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 119, 119, 64) 0           conv2_2_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv2_2_1x1_increase (Conv2D)   (None, 119, 119, 256 16384       activation_9[0][0]               
__________________________________________________________________________________________________
conv2_2_1x1_increase_bn (BatchN (None, 119, 119, 256 1024        conv2_2_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_2 (Add)                     (None, 119, 119, 256 0           conv2_2_1x1_increase_bn[0][0]    
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 119, 119, 256 0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2_3_1x1_reduce (Conv2D)     (None, 119, 119, 64) 16384       activation_10[0][0]              
__________________________________________________________________________________________________
conv2_3_1x1_reduce_bn (BatchNor (None, 119, 119, 64) 256         conv2_3_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 119, 119, 64) 0           conv2_3_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 121, 121, 64) 0           activation_11[0][0]              
__________________________________________________________________________________________________
conv2_3_3x3 (Conv2D)            (None, 119, 119, 64) 36864       zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
conv2_3_3x3_bn (BatchNormalizat (None, 119, 119, 64) 256         conv2_3_3x3[0][0]                
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 119, 119, 64) 0           conv2_3_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv2_3_1x1_increase (Conv2D)   (None, 119, 119, 256 16384       activation_12[0][0]              
__________________________________________________________________________________________________
conv2_3_1x1_increase_bn (BatchN (None, 119, 119, 256 1024        conv2_3_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_3 (Add)                     (None, 119, 119, 256 0           conv2_3_1x1_increase_bn[0][0]    
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 119, 119, 256 0           add_3[0][0]                      
__________________________________________________________________________________________________
conv3_1_1x1_reduce (Conv2D)     (None, 60, 60, 128)  32768       activation_13[0][0]              
__________________________________________________________________________________________________
conv3_1_1x1_reduce_bn (BatchNor (None, 60, 60, 128)  512         conv3_1_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 60, 60, 128)  0           conv3_1_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 62, 62, 128)  0           activation_14[0][0]              
__________________________________________________________________________________________________
conv3_1_3x3 (Conv2D)            (None, 60, 60, 128)  147456      zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
conv3_1_3x3_bn (BatchNormalizat (None, 60, 60, 128)  512         conv3_1_3x3[0][0]                
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 60, 60, 128)  0           conv3_1_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv3_1_1x1_increase (Conv2D)   (None, 60, 60, 512)  65536       activation_15[0][0]              
__________________________________________________________________________________________________
conv3_1_1x1_proj (Conv2D)       (None, 60, 60, 512)  131072      activation_13[0][0]              
__________________________________________________________________________________________________
conv3_1_1x1_increase_bn (BatchN (None, 60, 60, 512)  2048        conv3_1_1x1_increase[0][0]       
__________________________________________________________________________________________________
conv3_1_1x1_proj_bn (BatchNorma (None, 60, 60, 512)  2048        conv3_1_1x1_proj[0][0]           
__________________________________________________________________________________________________
add_4 (Add)                     (None, 60, 60, 512)  0           conv3_1_1x1_increase_bn[0][0]    
                                                                 conv3_1_1x1_proj_bn[0][0]        
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 60, 60, 512)  0           add_4[0][0]                      
__________________________________________________________________________________________________
conv3_2_1x1_reduce (Conv2D)     (None, 60, 60, 128)  65536       activation_16[0][0]              
__________________________________________________________________________________________________
conv3_2_1x1_reduce_bn (BatchNor (None, 60, 60, 128)  512         conv3_2_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 60, 60, 128)  0           conv3_2_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 62, 62, 128)  0           activation_17[0][0]              
__________________________________________________________________________________________________
conv3_2_3x3 (Conv2D)            (None, 60, 60, 128)  147456      zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
conv3_2_3x3_bn (BatchNormalizat (None, 60, 60, 128)  512         conv3_2_3x3[0][0]                
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 60, 60, 128)  0           conv3_2_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv3_2_1x1_increase (Conv2D)   (None, 60, 60, 512)  65536       activation_18[0][0]              
__________________________________________________________________________________________________
conv3_2_1x1_increase_bn (BatchN (None, 60, 60, 512)  2048        conv3_2_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_5 (Add)                     (None, 60, 60, 512)  0           conv3_2_1x1_increase_bn[0][0]    
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 60, 60, 512)  0           add_5[0][0]                      
__________________________________________________________________________________________________
conv3_3_1x1_reduce (Conv2D)     (None, 60, 60, 128)  65536       activation_19[0][0]              
__________________________________________________________________________________________________
conv3_3_1x1_reduce_bn (BatchNor (None, 60, 60, 128)  512         conv3_3_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 60, 60, 128)  0           conv3_3_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 62, 62, 128)  0           activation_20[0][0]              
__________________________________________________________________________________________________
conv3_3_3x3 (Conv2D)            (None, 60, 60, 128)  147456      zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
conv3_3_3x3_bn (BatchNormalizat (None, 60, 60, 128)  512         conv3_3_3x3[0][0]                
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 60, 60, 128)  0           conv3_3_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv3_3_1x1_increase (Conv2D)   (None, 60, 60, 512)  65536       activation_21[0][0]              
__________________________________________________________________________________________________
conv3_3_1x1_increase_bn (BatchN (None, 60, 60, 512)  2048        conv3_3_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_6 (Add)                     (None, 60, 60, 512)  0           conv3_3_1x1_increase_bn[0][0]    
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 60, 60, 512)  0           add_6[0][0]                      
__________________________________________________________________________________________________
conv3_4_1x1_reduce (Conv2D)     (None, 60, 60, 128)  65536       activation_22[0][0]              
__________________________________________________________________________________________________
conv3_4_1x1_reduce_bn (BatchNor (None, 60, 60, 128)  512         conv3_4_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 60, 60, 128)  0           conv3_4_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 62, 62, 128)  0           activation_23[0][0]              
__________________________________________________________________________________________________
conv3_4_3x3 (Conv2D)            (None, 60, 60, 128)  147456      zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
conv3_4_3x3_bn (BatchNormalizat (None, 60, 60, 128)  512         conv3_4_3x3[0][0]                
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 60, 60, 128)  0           conv3_4_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv3_4_1x1_increase (Conv2D)   (None, 60, 60, 512)  65536       activation_24[0][0]              
__________________________________________________________________________________________________
conv3_4_1x1_increase_bn (BatchN (None, 60, 60, 512)  2048        conv3_4_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_7 (Add)                     (None, 60, 60, 512)  0           conv3_4_1x1_increase_bn[0][0]    
                                                                 activation_22[0][0]              
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 60, 60, 512)  0           add_7[0][0]                      
__________________________________________________________________________________________________
conv4_1_1x1_reduce (Conv2D)     (None, 60, 60, 256)  131072      activation_25[0][0]              
__________________________________________________________________________________________________
conv4_1_1x1_reduce_bn (BatchNor (None, 60, 60, 256)  1024        conv4_1_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 60, 60, 256)  0           conv4_1_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 64, 64, 256)  0           activation_26[0][0]              
__________________________________________________________________________________________________
conv4_1_3x3 (Conv2D)            (None, 60, 60, 256)  589824      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
conv4_1_3x3_bn (BatchNormalizat (None, 60, 60, 256)  1024        conv4_1_3x3[0][0]                
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 60, 60, 256)  0           conv4_1_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv4_1_1x1_increase (Conv2D)   (None, 60, 60, 1024) 262144      activation_27[0][0]              
__________________________________________________________________________________________________
conv4_1_1x1_proj (Conv2D)       (None, 60, 60, 1024) 524288      activation_25[0][0]              
__________________________________________________________________________________________________
conv4_1_1x1_increase_bn (BatchN (None, 60, 60, 1024) 4096        conv4_1_1x1_increase[0][0]       
__________________________________________________________________________________________________
conv4_1_1x1_proj_bn (BatchNorma (None, 60, 60, 1024) 4096        conv4_1_1x1_proj[0][0]           
__________________________________________________________________________________________________
add_8 (Add)                     (None, 60, 60, 1024) 0           conv4_1_1x1_increase_bn[0][0]    
                                                                 conv4_1_1x1_proj_bn[0][0]        
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 60, 60, 1024) 0           add_8[0][0]                      
__________________________________________________________________________________________________
conv4_2_1x1_reduce (Conv2D)     (None, 60, 60, 256)  262144      activation_28[0][0]              
__________________________________________________________________________________________________
conv4_2_1x1_reduce_bn (BatchNor (None, 60, 60, 256)  1024        conv4_2_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 60, 60, 256)  0           conv4_2_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 64, 64, 256)  0           activation_29[0][0]              
__________________________________________________________________________________________________
conv4_2_3x3 (Conv2D)            (None, 60, 60, 256)  589824      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
conv4_2_3x3_bn (BatchNormalizat (None, 60, 60, 256)  1024        conv4_2_3x3[0][0]                
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 60, 60, 256)  0           conv4_2_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv4_2_1x1_increase (Conv2D)   (None, 60, 60, 1024) 262144      activation_30[0][0]              
__________________________________________________________________________________________________
conv4_2_1x1_increase_bn (BatchN (None, 60, 60, 1024) 4096        conv4_2_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_9 (Add)                     (None, 60, 60, 1024) 0           conv4_2_1x1_increase_bn[0][0]    
                                                                 activation_28[0][0]              
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 60, 60, 1024) 0           add_9[0][0]                      
__________________________________________________________________________________________________
conv4_3_1x1_reduce (Conv2D)     (None, 60, 60, 256)  262144      activation_31[0][0]              
__________________________________________________________________________________________________
conv4_3_1x1_reduce_bn (BatchNor (None, 60, 60, 256)  1024        conv4_3_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 60, 60, 256)  0           conv4_3_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 64, 64, 256)  0           activation_32[0][0]              
__________________________________________________________________________________________________
conv4_3_3x3 (Conv2D)            (None, 60, 60, 256)  589824      zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
conv4_3_3x3_bn (BatchNormalizat (None, 60, 60, 256)  1024        conv4_3_3x3[0][0]                
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 60, 60, 256)  0           conv4_3_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv4_3_1x1_increase (Conv2D)   (None, 60, 60, 1024) 262144      activation_33[0][0]              
__________________________________________________________________________________________________
conv4_3_1x1_increase_bn (BatchN (None, 60, 60, 1024) 4096        conv4_3_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_10 (Add)                    (None, 60, 60, 1024) 0           conv4_3_1x1_increase_bn[0][0]    
                                                                 activation_31[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 60, 60, 1024) 0           add_10[0][0]                     
__________________________________________________________________________________________________
conv4_4_1x1_reduce (Conv2D)     (None, 60, 60, 256)  262144      activation_34[0][0]              
__________________________________________________________________________________________________
conv4_4_1x1_reduce_bn (BatchNor (None, 60, 60, 256)  1024        conv4_4_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 60, 60, 256)  0           conv4_4_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 64, 64, 256)  0           activation_35[0][0]              
__________________________________________________________________________________________________
conv4_4_3x3 (Conv2D)            (None, 60, 60, 256)  589824      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
conv4_4_3x3_bn (BatchNormalizat (None, 60, 60, 256)  1024        conv4_4_3x3[0][0]                
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 60, 60, 256)  0           conv4_4_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv4_4_1x1_increase (Conv2D)   (None, 60, 60, 1024) 262144      activation_36[0][0]              
__________________________________________________________________________________________________
conv4_4_1x1_increase_bn (BatchN (None, 60, 60, 1024) 4096        conv4_4_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_11 (Add)                    (None, 60, 60, 1024) 0           conv4_4_1x1_increase_bn[0][0]    
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 60, 60, 1024) 0           add_11[0][0]                     
__________________________________________________________________________________________________
conv4_5_1x1_reduce (Conv2D)     (None, 60, 60, 256)  262144      activation_37[0][0]              
__________________________________________________________________________________________________
conv4_5_1x1_reduce_bn (BatchNor (None, 60, 60, 256)  1024        conv4_5_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 60, 60, 256)  0           conv4_5_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 64, 64, 256)  0           activation_38[0][0]              
__________________________________________________________________________________________________
conv4_5_3x3 (Conv2D)            (None, 60, 60, 256)  589824      zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
conv4_5_3x3_bn (BatchNormalizat (None, 60, 60, 256)  1024        conv4_5_3x3[0][0]                
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 60, 60, 256)  0           conv4_5_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv4_5_1x1_increase (Conv2D)   (None, 60, 60, 1024) 262144      activation_39[0][0]              
__________________________________________________________________________________________________
conv4_5_1x1_increase_bn (BatchN (None, 60, 60, 1024) 4096        conv4_5_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_12 (Add)                    (None, 60, 60, 1024) 0           conv4_5_1x1_increase_bn[0][0]    
                                                                 activation_37[0][0]              
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 60, 60, 1024) 0           add_12[0][0]                     
__________________________________________________________________________________________________
conv4_6_1x1_reduce (Conv2D)     (None, 60, 60, 256)  262144      activation_40[0][0]              
__________________________________________________________________________________________________
conv4_6_1x1_reduce_bn (BatchNor (None, 60, 60, 256)  1024        conv4_6_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 60, 60, 256)  0           conv4_6_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 64, 64, 256)  0           activation_41[0][0]              
__________________________________________________________________________________________________
conv4_6_3x3 (Conv2D)            (None, 60, 60, 256)  589824      zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
conv4_6_3x3_bn (BatchNormalizat (None, 60, 60, 256)  1024        conv4_6_3x3[0][0]                
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 60, 60, 256)  0           conv4_6_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv4_6_1x1_increase (Conv2D)   (None, 60, 60, 1024) 262144      activation_42[0][0]              
__________________________________________________________________________________________________
conv4_6_1x1_increase_bn (BatchN (None, 60, 60, 1024) 4096        conv4_6_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_13 (Add)                    (None, 60, 60, 1024) 0           conv4_6_1x1_increase_bn[0][0]    
                                                                 activation_40[0][0]              
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 60, 60, 1024) 0           add_13[0][0]                     
__________________________________________________________________________________________________
conv5_1_1x1_reduce (Conv2D)     (None, 60, 60, 512)  524288      activation_43[0][0]              
__________________________________________________________________________________________________
conv5_1_1x1_reduce_bn (BatchNor (None, 60, 60, 512)  2048        conv5_1_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 60, 60, 512)  0           conv5_1_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 68, 68, 512)  0           activation_44[0][0]              
__________________________________________________________________________________________________
conv5_1_3x3 (Conv2D)            (None, 60, 60, 512)  2359296     zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
conv5_1_3x3_bn (BatchNormalizat (None, 60, 60, 512)  2048        conv5_1_3x3[0][0]                
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 60, 60, 512)  0           conv5_1_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv5_1_1x1_increase (Conv2D)   (None, 60, 60, 2048) 1048576     activation_45[0][0]              
__________________________________________________________________________________________________
conv5_1_1x1_proj (Conv2D)       (None, 60, 60, 2048) 2097152     activation_43[0][0]              
__________________________________________________________________________________________________
conv5_1_1x1_increase_bn (BatchN (None, 60, 60, 2048) 8192        conv5_1_1x1_increase[0][0]       
__________________________________________________________________________________________________
conv5_1_1x1_proj_bn (BatchNorma (None, 60, 60, 2048) 8192        conv5_1_1x1_proj[0][0]           
__________________________________________________________________________________________________
add_14 (Add)                    (None, 60, 60, 2048) 0           conv5_1_1x1_increase_bn[0][0]    
                                                                 conv5_1_1x1_proj_bn[0][0]        
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 60, 60, 2048) 0           add_14[0][0]                     
__________________________________________________________________________________________________
conv5_2_1x1_reduce (Conv2D)     (None, 60, 60, 512)  1048576     activation_46[0][0]              
__________________________________________________________________________________________________
conv5_2_1x1_reduce_bn (BatchNor (None, 60, 60, 512)  2048        conv5_2_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 60, 60, 512)  0           conv5_2_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 68, 68, 512)  0           activation_47[0][0]              
__________________________________________________________________________________________________
conv5_2_3x3 (Conv2D)            (None, 60, 60, 512)  2359296     zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
conv5_2_3x3_bn (BatchNormalizat (None, 60, 60, 512)  2048        conv5_2_3x3[0][0]                
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 60, 60, 512)  0           conv5_2_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv5_2_1x1_increase (Conv2D)   (None, 60, 60, 2048) 1048576     activation_48[0][0]              
__________________________________________________________________________________________________
conv5_2_1x1_increase_bn (BatchN (None, 60, 60, 2048) 8192        conv5_2_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_15 (Add)                    (None, 60, 60, 2048) 0           conv5_2_1x1_increase_bn[0][0]    
                                                                 activation_46[0][0]              
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 60, 60, 2048) 0           add_15[0][0]                     
__________________________________________________________________________________________________
conv5_3_1x1_reduce (Conv2D)     (None, 60, 60, 512)  1048576     activation_49[0][0]              
__________________________________________________________________________________________________
conv5_3_1x1_reduce_bn (BatchNor (None, 60, 60, 512)  2048        conv5_3_1x1_reduce[0][0]         
__________________________________________________________________________________________________
activation_50 (Activation)      (None, 60, 60, 512)  0           conv5_3_1x1_reduce_bn[0][0]      
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 68, 68, 512)  0           activation_50[0][0]              
__________________________________________________________________________________________________
conv5_3_3x3 (Conv2D)            (None, 60, 60, 512)  2359296     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
conv5_3_3x3_bn (BatchNormalizat (None, 60, 60, 512)  2048        conv5_3_3x3[0][0]                
__________________________________________________________________________________________________
activation_51 (Activation)      (None, 60, 60, 512)  0           conv5_3_3x3_bn[0][0]             
__________________________________________________________________________________________________
conv5_3_1x1_increase (Conv2D)   (None, 60, 60, 2048) 1048576     activation_51[0][0]              
__________________________________________________________________________________________________
conv5_3_1x1_increase_bn (BatchN (None, 60, 60, 2048) 8192        conv5_3_1x1_increase[0][0]       
__________________________________________________________________________________________________
add_16 (Add)                    (None, 60, 60, 2048) 0           conv5_3_1x1_increase_bn[0][0]    
                                                                 activation_49[0][0]              
__________________________________________________________________________________________________
activation_52 (Activation)      (None, 60, 60, 2048) 0           add_16[0][0]                     
__________________________________________________________________________________________________
average_pooling2d_4 (AveragePoo (None, 6, 6, 2048)   0           activation_52[0][0]              
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 3, 3, 2048)   0           activation_52[0][0]              
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 2, 2, 2048)   0           activation_52[0][0]              
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 2048)   0           activation_52[0][0]              
__________________________________________________________________________________________________
conv5_3_pool6_conv (Conv2D)     (None, 6, 6, 512)    1048576     average_pooling2d_4[0][0]        
__________________________________________________________________________________________________
conv5_3_pool3_conv (Conv2D)     (None, 3, 3, 512)    1048576     average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
conv5_3_pool2_conv (Conv2D)     (None, 2, 2, 512)    1048576     average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
conv5_3_pool1_conv (Conv2D)     (None, 1, 1, 512)    1048576     average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
conv5_3_pool6_conv_bn (BatchNor (None, 6, 6, 512)    2048        conv5_3_pool6_conv[0][0]         
__________________________________________________________________________________________________
conv5_3_pool3_conv_bn (BatchNor (None, 3, 3, 512)    2048        conv5_3_pool3_conv[0][0]         
__________________________________________________________________________________________________
conv5_3_pool2_conv_bn (BatchNor (None, 2, 2, 512)    2048        conv5_3_pool2_conv[0][0]         
__________________________________________________________________________________________________
conv5_3_pool1_conv_bn (BatchNor (None, 1, 1, 512)    2048        conv5_3_pool1_conv[0][0]         
__________________________________________________________________________________________________
activation_56 (Activation)      (None, 6, 6, 512)    0           conv5_3_pool6_conv_bn[0][0]      
__________________________________________________________________________________________________
activation_55 (Activation)      (None, 3, 3, 512)    0           conv5_3_pool3_conv_bn[0][0]      
__________________________________________________________________________________________________
activation_54 (Activation)      (None, 2, 2, 512)    0           conv5_3_pool2_conv_bn[0][0]      
__________________________________________________________________________________________________
activation_53 (Activation)      (None, 1, 1, 512)    0           conv5_3_pool1_conv_bn[0][0]      
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 60, 60, 512)  0           activation_56[0][0]              
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 60, 60, 512)  0           activation_55[0][0]              
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 60, 60, 512)  0           activation_54[0][0]              
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 60, 60, 512)  0           activation_53[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 60, 60, 4096) 0           activation_52[0][0]              
                                                                 lambda_4[0][0]                   
                                                                 lambda_3[0][0]                   
                                                                 lambda_2[0][0]                   
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
conv5_4 (Conv2D)                (None, 60, 60, 512)  18874368    concatenate_1[0][0]              
__________________________________________________________________________________________________
conv5_4_bn (BatchNormalization) (None, 60, 60, 512)  2048        conv5_4[0][0]                    
__________________________________________________________________________________________________
activation_57 (Activation)      (None, 60, 60, 512)  0           conv5_4_bn[0][0]                 
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 60, 60, 512)  0           activation_57[0][0]              
__________________________________________________________________________________________________
conv6 (Conv2D)                  (None, 60, 60, 150)  76950       dropout_1[0][0]                  
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 473, 473, 150 0           conv6[0][0]                      
__________________________________________________________________________________________________
activation_58 (Activation)      (None, 473, 473, 150 0           lambda_5[0][0]                   
==================================================================================================
Total params: 46,841,174
Trainable params: 46,782,550
Non-trainable params: 58,624
__________________________________________________________________________________________________
